
export const VisitLevels = [
    {
        title: 'ورود به اپلیکیشن ایمپو',
        text: 'دانلود و نصب اپلیکیشن ایمپو'
    },
    {
        title: 'انتخاب بخش کلینیک',
        text: 'انتخاب بخش کلینیک در صفحه اصلی'
    },
    {
        title: 'انتخاب تخصص و پزشک',
        text: 'انتخاب تخصص (مثلا زنان، سکس‌تراپی و…) و انتخاب پزشک براساس مدت زمان پاسخگویی، امتیاز و نظرات کاربران'
    },
    {
        title: 'بارگذاری آزمایش یا گزارش (اختیاری)',
        text: 'بارگذاری آزمایش یا گزارش سلامت ایمپو در صورت نیاز'
    },
    {
        title: 'ثبت سوال و دریافت پاسخ تخصصی',
        text: 'ثبت سوال و شروع چت آنلاین با پزشک و دریافت پاسخ در ویزیت آنلاین'
    },
]