import { ResultLevelEnum } from './enum';
import { ResultDataType } from './type';

export const SENSITIVE_POINTS_BODY_RESULT_DATA: ResultDataType = {
  [ResultLevelEnum.LOW]: {
    title: 'آگاهی بدنی پایین (نیاز به لمس بیشتر 😉)',
    imageHeader: '/assets/images/sensitive/13.webp',
    description:
      'ارتباط ذهن و بدن ضعیف است و شبکه عصبی مسئول درک لمس و حس در بدنت کمتر فعال می‌شه و یا هنوز مهارت کافی برای تمرکز روی حس‌های ظریف بدنی رو نداری!',
    exercise: [
      {
        description: 'در هر دم و بازدم، توجه را به قسمت‌های مختلف بدن ببر (پاها، شکم، قفسه سینه، گردن).',
        title: 'تنفس بدنی آگاهانه (۵ دقیقه روزانه)',
        image: '/assets/images/sensitive/low/1.webp',
      },
      {
        description: 'بدون هدف لذت، فقط لمس بدن با تمرکز بر تفاوت‌های دما و حس تماس.',
        title: 'لمس آرام و ذهن‌آگاهی (۷ دقیقه)',
        image: '/assets/images/sensitive/low/2.webp',
      },
      {
        description:
          'بدنت رو در آینه ببین و از هر قسمت با احترام و مهربانی یاد کن (افزایش ارتباط شناختی و احساسی با بدن).',
        title: 'آینه و بدن (۲ بار در هفته)',
        image: '/assets/images/sensitive/low/3.webp',
      },
      {
        description: 'لمس نرم بدن با تمرکز بر حس مورمور شدن (۵دقیقه). یادداشت حس‌های جدید پس از هر تمرین (۲ دقیقه).',
        title: 'تنفس و لمس بدن در سکوت (۵ دقیقه)',
        image: '/assets/images/sensitive/low/4.webp',
      },
    ],
  },

  [ResultLevelEnum.MEDIUM]: {
    title: 'واکنش پذیر لمسی (کاوشگر لمس🧐)',
    imageHeader: '/assets/images/sensitive/12.webp',
    description:
      'در این تیپ، مسیرهای حسی به خوبی فعال می‌شن، اما الگوهای ذهنی درباره نوع لمس یا موقعیت تحریک هنوز محدودند. بدنت «می‌فهمه» چه چیزی خوشاینده، اما تنوع و آگاهی از مناطق مختلف هنوز کامل نیست. ذهن و بدنت هماهنگ هستند اما هنوز بخش‌های «ناشناخته» در بدنت باقی مونده .',
    exercise: [
      {
        description:
          'لمس آرام، سپس سریع، سپس توقف و توجه به تغییر حس در بدن. ماساژ ملایم ران و پشت با تغییر ریتم (۷ دقیقه)',
        title: 'لمس متنوع با تغییر ریتم (۱۰ دقیقه)',
        image: '/assets/images/sensitive/medium/1.webp',
      },
      {
        description:
          'با حوله گرم یا جسم خنک، آرام نقاط (گردن، بازو، ران) را لمس کن و نقاط با حس متفاوت را در ذهن علامت بزن.',
        title: 'آزمایش دما (۵ دقیقه)',
        image: '/assets/images/sensitive/medium/2.webp',
      },
      {
        description: 'تصور لمس نور یا گرما در بدن و سپس لمس واقعی همان نقطه برای  فعال‌سازی مسیرهای حسی - ذهنی.',
        title: 'تمرین تخیل حسی (۵ دقیقه)',
        image: '/assets/images/sensitive/medium/3.webp',
      },
    ],
  },

  [ResultLevelEnum.HIGH]: {
    title: 'آگاهی حسی - طلایی (لمس طلایی 🥰)',
    imageHeader: '/assets/images/sensitive/15.webp',
    description:
      'در این تیپ، هماهنگی بالایی بین ذهن، بدن وجود داره.به‌راحتی می‌تونی نقاط دقیق لذت و شرایط تحریک مطلوب خودت رو  تشخیص بدی. بدنت با ذهنت در هماهنگی کامل عمل می‌کنه و می‌تونی از طریق تخیل، تنفس، یا حتی نگاه، حس‌های لذت‌بخش رو فعال کنی و تجربه‌ی لذت برات چندبعدی (جسمی–عاطفی–ذهنی) هست.',
    exercise: [
      {
        description:
          'با لمس آگاهانه، نقاط جدید لذت را کشف و در ذهن ثبت کنید؛ لمس نقاط طلایی با تمرکز بر تنفس (۷ دقیقه) و سپس نوشتن نقشه حسی بدن و بررسی تغییرات در روزهای بعد.',
        title: 'نقشه برداری حسی پیشرفته (۲ بار در هفته)',
        image: '/assets/images/sensitive/high/1.webp',
      },
      {
        description:
          'چشم‌ها رو ببند و سه نفس عمیق بکش؛ یک بخش بدن رو انتخاب کن (مثلاً گردن، بازو، شکم یا شانه)، دستت رو آروم روش بذار و با لمس نرم ادامه بده و به حس گرما، فشار یا مورمور توجه کن.',
        title: 'لمس همراه با حضور ذهن (۱۰ دقیقه)',
        image: '/assets/images/sensitive/high/2.webp',
      },
      {
        description:
          'چند شیء یا پارچه با جنس‌های مختلف رو امتحان کن؛ هر بار با چشم بسته لمس کن و حس بدنت رو در نواحی مختلف بررسی کن تا ببینی کدوم جنس آرامش، گرما یا تحریک بیشتری ایجاد می‌کنه.',
        title: 'تمرین لمس با جنس های مختلف (۵ دقیقه)',
        image: '/assets/images/sensitive/high/3.webp',
      },
    ],
  },
};
