import { GeneticTestOnlineQuestionListTypes, GeneticTestOnlineResultListTypes } from './types';

export const GENETIC_TEST_ONLINE_STEP_QUERY_NAME = 'step';
export const GENETIC_TEST_ONLINE_STEP_SESSION_SCORE_NAME = 'testOnlineScore';
export const GENETIC_TEST_ONLINE_STEP_SESSION_DESCRIPTION_NAME = 'testOnlineDescription';

export const GENETIC_TEST_ONLINE_QUESTION_LIST: GeneticTestOnlineQuestionListTypes = {
  0: {
    step: 0,
    title: 'سن شما (مادر آینده) چند سال است؟',
    items: [
      { title: 'کمتر از ۳۰ سال', score: 0 },
      { title: '۳۰ تا ۳۵ سال', score: 1 },
      { title: 'بالای ۳۵ سال', score: 3 },
    ],
  },
  1: {
    step: 1,
    title: 'سن همسر/پدر آینده چند سال است؟',
    items: [
      { title: 'کمتر از ۴۰ سال', score: 0 },
      { title: '۴۰ تا ۵۰ سال', score: 1 },
      { title: 'بالای ۵۰ سال', score: 2 },
    ],
  },
  2: {
    step: 2,
    title: 'آیا شما و همسرتان خویشاوند هستید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله، فامیل درجه یک یا دو', score: 4 },
      { title: 'بله، فامیل دورتر', score: 2 },
    ],
  },
  3: {
    step: 3,
    title: 'آیا در خانواده شما یا همسرتان سابقه بیماری ژنتیکی وجود دارد؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله، بیماری مندلی', score: 5 },
      { title: 'بله، سایر بیماری‌ها', score: 3 },
    ],
  },
  4: {
    step: 4,
    title: 'آیا در خانواده شما یا همسرتان سابقه سقط مکرر وجود دارد؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 3 },
    ],
  },
  5: {
    step: 5,
    title: 'آیا در خانواده شما یا همسرتان سابقه بیماری‌های کروموزومی وجود دارد؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 9 },
    ],
  },
  6: {
    step: 6,
    title: 'آیا شما یا همسرتان سابقه بیماری مزمن دارید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 2 },
    ],
  },
  7: {
    step: 7,
    title: 'آیا شما یا همسرتان آزمایش ژنتیکی انجام داده‌اید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله، نتیجه نرمال', score: 0 },
      { title: 'بله، ناقل یا مبتلا', score: 5 },
    ],
  },
  8: {
    step: 8,
    title: 'آیا شما یا همسرتان سابقه مشکلات باروری دارید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 2 },
    ],
  },
  9: {
    step: 9,
    title: 'آیا شما یا همسرتان سیگار، الکل یا مواد مخدر مصرف می‌کنید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 2 },
    ],
  },
  10: {
    step: 10,
    title: 'آیا شما یا همسرتان در معرض مواد شیمیایی یا اشعه هستید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 2 },
    ],
  },
  11: {
    step: 11,
    title: 'آیا مکمل اسید فولیک مصرف می‌کنید؟',
    items: [
      { title: 'بله', score: 0 },
      { title: 'خیر', score: 1 },
    ],
  },
  12: {
    step: 12,
    title: 'آیا در خانواده شما یا همسرتان سابقه تولد نوزاد با ناهنجاری مادرزادی وجود دارد؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 4 },
    ],
  },
  13: {
    step: 13,
    title: 'آیا مورد خاصی وجود دارد که نگران آن هستید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله (لطفاً توضیح دهید)', score: 2 },
    ],
  },
};

export const GENETIC_TEST_ONLINE_RESULTS_LIST: GeneticTestOnlineResultListTypes = {
  result1: {
    id: 1,
    header: {
      title: 'ریسک بالا',
      description: 'مشاوره با متخصص ژنتیک و انجام آزمایشات پیشرفته',
      color: 'Error_Error',
    },
    section1: {
      intro:
        ' نتیجه‌ای که بر اساس پاسخ‌های شما به‌دست اومده، نشون می‌ده که ریسک ژنتیکی‌ات در سطح نسبتاً بالا قرار داره.',
      title: '',
      text: 'این یعنی بعضی از عوامل مهم مثل:',
      items: [
        {
          title: 'سابقه‌ی خانوادگی',
          icon: '/assets/images/genetic/result/family.webp',
        },
        {
          title: 'سن',
          icon: '/assets/images/genetic/result/age.webp',
        },
        {
          title: 'یا شرایط بالینی',
          icon: '/assets/images/genetic/result/clinical.webp',
        },
      ],
      textBottom: 'باعث شدن احتمال بروز مشکلات ژنتیکی در فرزند احتمالی کمی بیشتر از حد نرمال باشه',
    },
    section2: [
      {
        title: 'مشاوره ژنتیک فوری',
        icon: '/assets/images/genetic/lowRisk/1.webp',
        text: 'اولویت اولت باید یک جلسه مشاوره‌ی دقیق با مشاور ژنتیک باشه. ما در پلتفرم، متخصص ژنتیک باتجربه‌ای داریم که می‌تونه بر اساس شرایطت، مسیرت رو مشخص کنه، از انجام آزمایشات ضروری گرفته تا راهکارهای پیشگیری.',
      },
      {
        title: 'آزمایش‌های اختصاصی',
        icon: '/assets/images/genetic/highRisk/2.webp',
        text: 'در موارد با ریسک بالا، ممکنه لازم باشه تست‌های تکمیلی انجام بشه، مثل بررسی ناقل بودن بیماری‌ها، کاریوتایپ، یا حتی غربالگری پیش از لانه‌گزینی.',
      },
      {
        title: 'برنامه‌ریزی برای بارداری آگاهانه',
        icon: '/assets/images/genetic/highRisk/3.webp',
        text: 'اگر عامل ارثی در میان باشه، مشاور ممکنه پیشنهاد کنه سایر اعضای خانواده‌ات هم بررسی بشن. این کار بهت دید بهتری از وضعیت ژنتیکی خانوادگی می‌ده.',
      },
      {
        title: 'آگاهی خانواده',
        icon: '/assets/images/genetic/highRisk/4.webp',
        text: 'با همراهی پزشک زنان و متخصص ژنتیک، می‌تونی مسیر اقدام به بارداری رو با برنامه‌ریزی دقیق‌تر پیش ببری—با آرامش، نه استرس.',
      },
    ],
    section3: [
      {
        title: 'آزمایش خاصی هست که انجام بدم؟؟',
        icon: '/assets/images/genetic/lowRisk/4.webp',
        text: 'احتمالاً نیاز باشه که یکسری آزمایش‌هارو انجام بدی تا مطمئن بشیم که خطری متوجه تو و فرزندت نیست. تست‌های ژنتیکی انواع مختلفی دارند و برای شرایط مختلف تجویز می‌شن. اصولاً برای اطلاع از اینکه چه تست‌هایی می‌تونه شمارو به نتیجه دقیق برای پیگیری بیشتر می‌رسونه، باید یک مشاوره با متخصص ژنتیک داشته باشید تا از هزینه اضافه و اتلاف زمان جلوگیری بشه.',
      },
    ],
    footer: {
      title: 'خیالم راحت باشه؟',
      text: 'نگران نباش، ولی بی‌تفاوت هم نباش. ما اینجا هستیم که آگاهت کنیم، نه بترسونیم! ریسک بالا فقط یعنی باید با دقت بیشتری ادامه بدی. اگه سوالی داشتی یا خواستی اقدام کنی، تیم ما کنارت هست تا بهترین تصمیم رو بگیری..',
    },
  },
  result2: {
    id: 2,
    header: {
      title: 'ریسک متوسط',
      description: 'مشاوره با متخصص ژنتیک و انجام آزمایشات پیشرفته',
      color: 'Warning_Warning',
    },
    section1: {
      intro:
        ' بر اساس اطﻼعاتی که تو پرسشنامه دادی، ریسک ژنتیکی‌ات متوسطه. یعنی نه خیلی پایینه و نه خیلی باﻻست. جای نگرانی جدی نیست، ولی بهتره یه کم بیشتر مراقب باشی حاﻻ برات ساده و خلاصه توضیح می‌دم که چی به چیه و چیکار کنی.',
      title: 'چرا ریسکت متوسط شده؟',
      text: 'با توجه به موارد ریسکی که برای باردار شدن اهمیت دارن مثل :',
      items: [
        {
          title: 'سابقه‌ی خانوادگی',
          icon: '/assets/images/genetic/result/family.webp',
        },
        {
          title: 'سن',
          icon: '/assets/images/genetic/result/age.webp',
        },
        {
          title: 'سبک زندگی‌ات',
          icon: '/assets/images/genetic/result/lifeStyle.webp',
        },
      ],
      textBottom:
        'یه سری فاکتورها هستن که ریسک رو یه کم باﻻ می‌برن. ولی این اصلاً به معنی ایجاد یک مشکل حتمی در فرزند تو یا اختلال در بارداری نیست! درواقع فقط با مراقبت‌هایی که مشاور ژنتیک بهت گوشزد می‌کنه می‌تونی خیالت رو بابت داشتن یک بارداری عالی و سالم راحت کنی.',
    },
    section2: [
      {
        title: 'مشاوره ژنتیک',
        icon: '/assets/images/genetic/lowRisk/1.webp',
        text: 'با یک مشاور ژنتیک مشورت کن؛ ما یک متخصص ژنتیک کارکشته رو اخیراً به جمعمون اضافه کردیم. اگر لازم باشه آزمایش‌های خاصی رو بهت معرفی می‌کنه',
      },
      {
        title: 'سبک زندگی',
        icon: '/assets/images/genetic/mediumRisk/2.webp',
        text: 'سیگار، قلیان و الکل رو کنار بذار، تغذیه سالم داشته باش و ورزش کن.',
      },
      {
        title: 'دارو',
        icon: '/assets/images/genetic/mediumRisk/3.webp',
        text: 'ترس و خودسرانه هیچ دارویی رو شروع نکن، از مصرف داروهای گیاهی حتی اگر از داروخانه تهیه کردی پرهیز کن. اگر لازم بشه خود متخصصین داروهای لازم (حتی تقویتی و ویتامین‌ها) رو بهت می‌دن.',
      },
      {
        title: 'حفظ ارتباط با دکترت',
        icon: '/assets/images/genetic/mediumRisk/4.webp',
        text: 'بعد از مشورت با متخصص ژنتیک، با یک متخصص زنان و زایمان هم صحبت کن و اطلاعات ژنتیکی‌ای که بهت داده شده رو به ایشون انتقال بده و بگو ریسکت متوسط بوده تا برات برنامه مراقبتی بچینند.',
      },
    ],
    section3: [
      {
        title: 'آزمایش خاصی هست که انجام بدم؟',
        icon: '/assets/images/genetic/lowRisk/4.webp',
        text: 'آزمایشات مختلفی وجود دارند که می‌تونن ریسک‌های مختلف ژنتیکی رو مورد بررسی قرار بدن ولی تعداد اونها زباده و بنابراین مشاور ژنتیک باید مستقیماً باهات صحبت کنه و آزمایش مخصوص به شرایط خودت رو توصیه کنه با این وجود آزمایشاتی که تقریباً همه قبل از اقدام برای بارداری انجام میدن شامل موارد زیر هستش:',
      },
      {
        title: 'آزمایش ساده',
        icon: '/assets/images/genetic/lowRisk/5.webp',
        text: 'قبل بارداری، یه چکاپ خون روتین و سونوگرافی انجام بده.',
      },
      {
        title: ' بررسی اسپرم',
        icon: '/assets/images/genetic/lowRisk/6.webp',
        text: 'همسرت حتماً یک یا نهایتاً دو هفته قبل از اقدام یک آزمایش آنالیز اسپرم انجام بده.',
      },
    ],
    footer: {
      title: ' خیالم راحت باشه؟',
      text: 'بله، ریسک متوسط یعنی با این راهکارها، احتمال ایجاد مشکل در فرزندتان «کم» می‌شه. این فقط یه ارزیابی اولیه‌ست، پس برای اطمینان بیشتر با دکتر متخصص ژنتیکت همسو و در ارتباط باش. اگه سوالی داشتی حتماً از ما بپرس تا کمکت کنیم، مواظب خودت باش!',
    },
  },
  result3: {
    id: 3,
    header: {
      title: 'ریسک پایین',
      description: 'مشاوره با متخصص ژنتیک و انجام آزمایشات پیشرفته',
      color: 'Success_Success',
    },
    section1: {
      intro:
        'خیالت راحت باشه، ریسک ژنتیکی‌ات فعلاً پایینه و این یعنی احتمال مشکل ژنتیکی جدی برای بارداریت خیلی کمه. حاﻻ برات خیلی خلاصه و ساده توضیح می‌دم که چرا اینطوره و چیکار کنی!',
      title: 'چرا ریسکت پایینه؟',
      text: 'با توجه به موارد ریسکی که برای باردار شدن اهمیت دارن مثل :',
      items: [
        {
          title: 'سابقه‌ی خانوادگی',
          icon: '/assets/images/genetic/result/family.webp',
        },
        {
          title: 'سن',
          icon: '/assets/images/genetic/result/age.webp',
        },
        {
          title: 'سبک زندگی‌ات',
          icon: '/assets/images/genetic/result/lifeStyle.webp',
        },
      ],
      textBottom:
        'یه سری فاکتورها هستن که ریسک رو یه کم باﻻ می‌برن. ولی این اصلاً به معنی ایجاد یک مشکل حتمی در فرزند تو یا اختلال در بارداری نیست! درواقع فقط با مراقبت‌هایی که مشاور ژنتیک بهت گوشزد می‌کنه می‌تونی خیالت رو بابت داشتن یک بارداری عالی و سالم راحت کنی.',
    },
    section2: [
      {
        title: 'مشاوره',
        icon: '/assets/images/genetic/lowRisk/1.webp',
        text: 'اگه سوالی داری، با دکتر زنان یا مشاور ژنتیک حرف بزن.',
      },
      {
        title: 'اسید فولیک',
        icon: '/assets/images/genetic/lowRisk/2.webp',
        text: 'روزی 400 میکروگرم از ۱ ماه قبل از اقدام شروع کن (اگر تاﻻسمی مینور هستی دوز ۵ برای ۳ ماه توصیه میشه)، برای سلامت جنین و کاهش احتمال نقص در لوله عصبی عالیه..',
      },
      {
        title: 'زندگی سالم',
        icon: '/assets/images/genetic/lowRisk/3.webp',
        text: 'سیگار، قلیان و الکل رو کنار بذار (از دود آن‌ها هم دوری کن)، تغذیه خوب و ورزش رو ادامه بده.',
      },
    ],
    section3: [
      {
        title: 'آزمایش خاصی هست که انجام بدم؟',
        icon: '/assets/images/genetic/lowRisk/4.webp',
        text: 'این فقط یه ارزیابی اولیه‌ست، پس آزمایش‌ها و مشورت با مشاور ژنتیک رو جدی بگیر حتی اگر فرزند سالم داری و هیچوقت مشکل ژنتیکی‌ای متوجه‌تون نبوده. با خیال راحت برو جلو و اگه چیزی ذهنت رو مشغول کرد از ما بپرس تا کمکت کنیم!',
      },
      {
        title: 'آزمایش ساده',
        icon: '/assets/images/genetic/lowRisk/5.webp',
        text: 'قبل بارداری، یه چکاپ خون روتین و سونوگرافی انجام بده.',
      },
      {
        title: ' بررسی اسپرم',
        icon: '/assets/images/genetic/lowRisk/6.webp',
        text: 'همسرت حتماً  یک یا نهایتاً دو هفته قبل از اقدام یک آزمایش آنالیز اسپرم انجام بده.',
      },
    ],
    footer: {
      title: 'خیالم کامل راحت باشه؟',
      text: 'تقریباً! ژنتیک یه کم پیچیده ‌ست و همیشه یه احتمال خیلی کوچیک برای چیزای غیرمنتظره وجود داره که با شروع بارداری و تحت نظر متخصصین ژنتیک و متخصصین زنان بودن همگی قابل مدیریت و حتی پیشگیری هستند. با این حال اﻻن با این اطﻼعات جایی برای نگرانی خاصی وجود نداره.',
    },
  },
};
