import { FaqTypes } from '../ovulationCalculator/types';

export const FAQS: FaqTypes = [
  {
    id: '1',
    question: 'برای استفاده از ابزار محاسبه آنلاین سیکل قاعدگی چه اطلاعاتی نیاز است؟',
    answer:
      'باید زمان دقیق آخرین پریود، طول سیکل و مدت زمان پریود را وارد کنید. با ثبت این اطلاعات، ابزار می‌تواند به‌صورت آنلاین تاریخ پریود بعدی را با دقت بالایی محاسبه کند.',
  },
  {
    id: '2',
    question: 'آیا ابزار محاسبه سیکل قاعدگی دقیق است؟',
    answer:
      'بله، اگر تاریخ روز اول پریود و طول سیکل را درست وارد کنید، ابزار می‌تواند با دقت بالا زمان احتمالی پریود بعدی و تخمک‌گذاری را پیش‌بینی کند.',
  },
  {
    id: '3',
    question:
      'آیا با سیکل نامنظم هم می‌توان از ابزار محاسبه سیکل قاعدگی آنلاین برای پیش‌بینی زمان پریود بعدی استفاده کرد؟',
    answer:
      'بله، در سیکل‌های نامنظم هم می‌توانید از ابزار محاسبه سیکل قاعدگی آنلاین استفاده کرد، البته دقت محاسباتی در این شرایط کمتر می‌شود. ',
  },
];
