import { FaqItemType } from './type';

export const FAG_LIST: FaqItemType[] = [
  {
    question: 'همدلی با پارتنرم چجوریه و به چه دردی می‌خوره؟',
    answer:
      ' خیر، معمولاً استفاده از کیت تخمک‌گذاری در دوران قاعدگی توصیه نمی‌شود، زیرا سطح هورمون LH در این روزها پایین است و نتایج می‌توانند غیرقابل اعتماد باشند. بهترین زمان برای تست، چند روز پس از پایان قاعدگی است، معمولاً در میانه سیکل قاعدگی.',
  },
  {
    question: 'چه اطلاعاتی از من با پارتنرم به‌اشتراک گذاشته می‌شه؟',
    answer:
      ' خیر، معمولاً استفاده از کیت تخمک‌گذاری در دوران قاعدگی توصیه نمی‌شود، زیرا سطح هورمون LH در این روزها پایین است و نتایج می‌توانند غیرقابل اعتماد باشند. بهترین زمان برای تست، چند روز پس از پایان قاعدگی است، معمولاً در میانه سیکل قاعدگی.',
  },
  {
    question: 'هر هدف نصبی داشته باشم میتونم با پارتنرم از همدلی استفاده کنیم؟',
    answer:
      ' خیر، معمولاً استفاده از کیت تخمک‌گذاری در دوران قاعدگی توصیه نمی‌شود، زیرا سطح هورمون LH در این روزها پایین است و نتایج می‌توانند غیرقابل اعتماد باشند. بهترین زمان برای تست، چند روز پس از پایان قاعدگی است، معمولاً در میانه سیکل قاعدگی.',
  },
  {
    question: 'هر وقت بخوام میتونم پارتنرم رو از همدلی حذف کنم؟',
    answer:
      ' خیر، معمولاً استفاده از کیت تخمک‌گذاری در دوران قاعدگی توصیه نمی‌شود، زیرا سطح هورمون LH در این روزها پایین است و نتایج می‌توانند غیرقابل اعتماد باشند. بهترین زمان برای تست، چند روز پس از پایان قاعدگی است، معمولاً در میانه سیکل قاعدگی.',
  },
];
