export const Questions = [
    {
        id: '1',
        title: ' آیا می‌توانم پزشکم را خودم انتخاب کنم؟',
        text: 'بله، شما می‌توانید با بررسی پروفایل، امتیاز و زمان پاسخ‌دهی، دکتر آنلاین دلخواهتان را انتخاب کنید.'
    },
    {
        id: '2',
        title: 'در صورت نارضایتی از پزشک در ویزیت آنلاین چه می‌شود؟',
        text: 'می‌توانید پزشک آنلاین خود را تغییر دهید یا در صورت بروز مشکل، درخواست بازگشت وجه ثبت کنید.'
    },
    {
        id: '3',
        title: ' آیا امکان دریافت نسخه دارویی از دکتر آنلاین وجود دارد؟',
        text: 'بله، پزشک می‌تواند در صورت نیاز نسخه تجویز کند یا شما را به مرحله درمان بعدی راهنمایی کند.'
    },
    {
        id: '4',
        title: 'آیا در روزهای تعطیل هم پاسخ‌گویی در ویزیت آنلاین انجام می‌شود؟',
        text: 'بله، تیم پزشکی ایمپو در تمام ایام هفته، از جمله تعطیلات، در دسترس است.'
    },

]