import mode1 from '@assets/images/blackFriday/mode1.jpeg';
import mode2 from '@assets/images/blackFriday/mode2.jpeg';
import mode3 from '@assets/images/blackFriday/mode3.jpeg';
import mode4 from '@assets/images/blackFriday/mode4.jpeg';
import mode5 from '@assets/images/blackFriday/mode5.jpeg';
import mode6 from '@assets/images/blackFriday/mode6.jpeg';
import mode7 from '@assets/images/blackFriday/mode7.jpeg';
import mode8 from '@assets/images/blackFriday/mode8.jpeg';
import mode9 from '@assets/images/blackFriday/mode9.jpeg';
import mode10 from '@assets/images/blackFriday/mode10.jpeg';
import mode11 from '@assets/images/blackFriday/mode11.jpeg';
import mode12 from '@assets/images/blackFriday/mode12.jpeg';

import { RewardData } from '../types';

export const EVENT_OPTIONS = {
  aram: {
    copyCode: 'aram_copy',
    download: 'aram_photo',
    useCode: 'aram_use',
  },

  asa: {
    copyCode: 'asa_copy',
    download: 'asa_photo',
    useCode: 'asa_use',
  },

  yar: {
    copyCode: 'yar_copy',
    download: 'yar_photo',
    useCode: 'yar_use',
  },

  baz: {
    copyCode: 'baz_copy',
    download: 'baz_photo',
    useCode: 'baz_use',
  },
} as const;

export const REWARD_MAP: Record<string, RewardData> = {
  'a-a3-1': {
    title: 'دل‌آرام',
    description:
      'دل‌آرام؛ آرامشِ دل، نماد فردی که آرامش رو به دلش هدیه کرده. مثل تو که وسط شلوغی و کار و بار تونستی برای خودت و مراقبت از خودت زمان بذاری، یعنی ارزش و قدر خودتو می‌دونی. ما در ایمپو بهت افتخار می‌کنیم، دلت همیشه آروم.',
    image: mode1.src,
    discountCode: 'Delaram70',
    textDiscount: 'کد تخفیف ۷۰ درصدی روی پلن یکساله رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.aram,
  },

  'a-a3-2': {
    title: 'دل‌آرام',
    description:
      'دل‌آرام؛ آرامشِ دل، نماد فردی که آرامش رو به دلش هدیه کرده مثل تو که وسط شلوغی و کار و بار تونستی برای خودت و مراقبت از خودت زمان بذاری. اینو بدون تو اول باید از خودت مراقبت کنی تا بتونی از رابطه‌ات هم به‌خوبی مراقبت کنی.ما در ایمپو بهت افتخار می‌کنیم. دلت همیشه آروم.',
    image: mode2.src,
    discountCode: 'Delaram70',
    textDiscount: 'کد تخفیف ۷۰ درصدی روی پلن یکساله رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.aram,
  },

  'a-a3-3': {
    title: 'دل‌آرام',
    description:
      'دل‌آرام؛ آرامشِ دل. نماد فردی که آرامش رو به دلش هدیه کرده، درست مثل تو که وسط شلوغی و مادرانگی‌هات، برای خودت و مراقبت از خودت زمان می‌ذاری، یعنی ارزش و قدر خودتو می‌دونی، تو یه مامان آگاهی که اولین معلم آموزش خودمراقبتی به فرزند هستی. ما در ایمپو بهت افتخار می‌کنیم. دلت همیشه آروم.',
    image: mode3.src,
    discountCode: 'Delaram70',
    textDiscount: 'کد تخفیف ۷۰ درصدی روی پلن یکساله رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.aram,
  },

  'a-a2-1': {
    title: 'دل‌‌آسا',
    description:
      'دل‌آسا؛ آسوده نگه داشتن دل. فردی که در حفظ کردن و آسوده نگه داشتن دل و روحش تلاش می‌کنه. درست مثل تو که بین مشغله‌هات، مراقب خودت هستی. ما در ایمپو بهت افتخار می‌کنیم چون برای مراقبت از خودت تلاش می‌کنی. دلت همیشه آسوده.',
    image: mode4.src,
    discountCode: 'Delasa55',
    textDiscount: 'کد تخفیف 55 درصدی روی پلن شش ماهه رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.asa,
  },

  'a-a2-2': {
    title: 'دل‌‌آسا',
    description:
      'دل‌آسا؛ آسوده نگه داشتن دل. فردی که برای حفظ کردن آسودگی دل و روحش تلاش می‌کنه. درست مثل تو که بین مشغله‌هات، مراقب خودت هستی. ما در ایمپو  بهت افتخار می‌کنیم که برای مراقبت از خودت تلاش می‌کنی، چون کسی که بلده از خودش مراقبت کنه به‌خوبی می‌تونه از رابطه‌اش هم مراقبت کنه. دلت همیشه آسوده.',
    image: mode5.src,
    discountCode: 'Delasa55',
    textDiscount: 'کد تخفیف 55 درصدی روی پلن شش ماهه رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.asa,
  },

  'a-a2-3': {
    title: 'دل‌‌آسا',
    description:
      'دل‌آسا؛ آسوده نگه داشتن دل. فردی که در حفظ کردن و آسوده نگه داشتن دل و روحش تلاش می‌کنه. درست مثل تو که بین مشغله‌هات و مسئولیت مهم مادرانگی، مراقب خودت هستی. ما در ایمپو بهت افتخار می‌کنیم چون برای مراقبت از خودت تلاش می‌کنی و به خودت اهمیت میدی. تو یک مادر آگاه و نمونه هستی.  دلت همیشه آسوده.',
    image: mode6.src,
    discountCode: 'Delasa55',
    textDiscount: 'کد تخفیف 55 درصدی روی پلن شش ماهه رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.asa,
  },

  'a-a1-2': {
    title: 'دل‌‌یار',
    description:
      'دل‌یار، یارِ دل. کسی که به‌تازگی قدم در مسیر خودمراقبتی گذاشته. درست مثل که تو بیشتر از قبل مراقب خودتی و با مراقبت از خودت می‌تونی رابطه قشنگ‌تری بسازی. ما در ایمپو بهت افتخار می‌کنیم که تصمیم گرفتی به جسم و روحت یاری برسونی و در مسیر بهتر کردن حالت، قدم برداری. دلت همیشه یارِت.',
    image: mode7.src,
    discountCode: 'Delyar40',
    textDiscount: 'کد تخفیف 40 درصدی روی پلن سه ماهه رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.yar,
  },

  'a-a1-1': {
    title: 'دل‌‌یار',
    description:
      'دل‌یار، یارِ دل. کسی که به‌تازگی قدم در مسیر خودمراقبتی گذاشته. مثل تو که انتخاب کردی  به جسم و روحت یاری برسونی. ما در ایمپو بهت افتخار می‌کنیم که تصمیم گرفتی از مهم‌ترین سرمایه‌ات یعنی جسم و روحت مراقبت کنی و در مسیر بهتر کردن حالت، قدم برداری. دلت همیشه یارِت.',
    image: mode8.src,
    discountCode: 'Delyar40',
    textDiscount: 'کد تخفیف 40 درصدی روی پلن سه ماهه رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.yar,
  },

  'a-a1-3': {
    title: 'دل‌‌یار',
    description:
      'دل‌یار، یارِ دل. کسی که به‌تازگی قدم در مسیر خودمراقبتی گذاشته. درست مثل تو که انتخاب کردی  به جسم و روحت یاری برسونی. ما در ایمپو بهت افتخار می‌کنیم که تصمیم گرفتی از مهم‌ترین سرمایه‌ات یعنی جسم و روحت مراقبت کنی و در مسیر بهتر کردن حالت، قدم برداری تا بتونی در مراقبت کردن از فرزندت هم موفق باشی. دلت همیشه یارِت.',
    image: mode9.src,
    discountCode: 'Delyar40',
    textDiscount: 'کد تخفیف 40 درصدی روی پلن سه ماهه رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.yar,
  },

  'c-none-1': {
    title: 'دل‌‌یار',
    description:
      'دل‌یار، یارِ دل. کسی که به‌تازگی قدم در مسیر خودمراقبتی گذاشته. مثل تو که انتخاب کردی  به جسم و روحت یاری برسونی. ما در ایمپو بهت افتخار می‌کنیم که تصمیم گرفتی از مهم‌ترین سرمایه‌ات یعنی جسم و روحت مراقبت کنی و در مسیر بهتر کردن حالت، قدم برداری. دلت همیشه یارِت.',
    image: mode8.src,
    discountCode: 'Delyar40',
    textDiscount: 'کد تخفیف 40 درصدی روی پلن سه ماهه رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.yar,
  },

  'c-none-2': {
    title: 'دل‌‌یار',
    description:
      'دل‌یار، یارِ دل. کسی که به‌تازگی قدم در مسیر خودمراقبتی گذاشته. درست مثل که تو بیشتر از قبل مراقب خودتی و با مراقبت از خودت می‌تونی رابطه قشنگ‌تری بسازی. ما در ایمپو بهت افتخار می‌کنیم که تصمیم گرفتی به جسم و روحت یاری برسونی و در مسیر بهتر کردن حالت، قدم برداری. دلت همیشه یارِت.',
    image: mode7.src,
    discountCode: 'Delyar40',
    textDiscount: 'کد تخفیف 40 درصدی روی پلن سه ماهه رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.yar,
  },

  'c-none-3': {
    title: 'دل‌‌یار',
    description:
      'دل‌یار، یارِ دل. کسی که به‌تازگی قدم در مسیر خودمراقبتی گذاشته. درست مثل تو که انتخاب کردی  به جسم و روحت یاری برسونی. ما در ایمپو بهت افتخار می‌کنیم که تصمیم گرفتی از مهم‌ترین سرمایه‌ات یعنی جسم و روحت مراقبت کنی و در مسیر بهتر کردن حالت، قدم برداری تا بتونی در مراقبت کردن از فرزندت هم موفق باشی. دلت همیشه یارِت.',
    image: mode9.src,
    discountCode: 'Delyar40',
    textDiscount: 'کد تخفیف 40 درصدی روی پلن سه ماهه رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.yar,
  },

  'b-a1-1': {
    title: 'دل باز',
    description:
      'دل‌باز؛ بازگشته به دل. فردی که دوباره در مسیر خودمراقبتی قرار گرفته. درست مثل تو که تصمیم گرفتی از بزرگ‌ترین و ارزشمندترین سرمایه‌ات، یعنی خودت مراقبت کنی. ما در ایمپو بهت افتخار می‌کنیم که تو مسیر خودمراقبتی قدم گذاشتی و در این مسیر حرکت می‌کنی.',
    image: mode10.src,
    discountCode: 'Delbaz60',
    textDiscount: 'کد تخفیف 60 درصدی روی پلن شش ماهه رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.baz,
  },

  'b-a1-2': {
    title: 'دل باز',
    description:
      'دل‌باز؛ بازگشته به دل. فردی که دوباره در مسیر خودمراقبتی قرار گرفته. درست مثل تو که تصمیم گرفتی از بزرگ‌ترین و ارزشمندترین سرمایه‌ات، یعنی خودت مراقبت کنی و با مراقبت از خودت می‌تونی رابطه قشنگ‌تری بسازی. ما در ایمپو بهت افتخار می‌کنیم که تو مسیر خودمراقبتی قدم گذاشتی و در این مسیر حرکت می‌کنی.',
    image: mode11.src,
    discountCode: 'Delbaz60',
    textDiscount: 'کد تخفیف 60 درصدی روی پلن شش ماهه رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.baz,
  },

  'b-a1-3': {
    title: 'دل باز',
    description:
      'دل‌باز؛ بازگشته به دل. فردی که دوباره در مسیر خودمراقبتی قرار گرفته. ما در ایمپو بهت افتخار می‌کنیم که تو مسیر خودمراقبتی قدم گذاشتی و در این مسیر حرکت می‌کنی و تصمیم گرفتی از مهم‌ترین سرمایه‌ات یعنی جسم و روحت مراقبت کنی تا بتونی در مراقبت کردن از فرزندت هم موفق باشی.',
    image: mode12.src,
    discountCode: 'Delbaz60',
    textDiscount: 'کد تخفیف 60 درصدی روی پلن شش ماهه رو با عشق تقدیمت می‌کنیم تا همراهت در این سفر باشیم.',
    eventOption: EVENT_OPTIONS.baz,
  },
};
