import { GeneticTestOnlineQuestionListTypes, GeneticTestOnlineResultListTypes } from './types';

export const GENETIC_TEST_ONLINE_STEP_QUERY_NAME = 'step';
export const GENETIC_TEST_ONLINE_STEP_SESSION_SCORE_NAME = 'testOnlineScore';
export const GENETIC_TEST_ONLINE_STEP_SESSION_DESCRIPTION_NAME = 'testOnlineDescription';

export const GENETIC_TEST_ONLINE_QUESTION_LIST: GeneticTestOnlineQuestionListTypes = {
  0: {
    step: 0,
    title: 'سن شما (مادر آینده) چند سال است؟',
    items: [
      { title: 'کمتر از ۳۰ سال', score: 0 },
      { title: '۳۰ تا ۳۵ سال', score: 1 },
      { title: 'بالای ۳۵ سال', score: 3 },
    ],
  },
  1: {
    step: 1,
    title: 'سن همسر/پدر آینده چند سال است؟',
    items: [
      { title: 'کمتر از ۴۰ سال', score: 0 },
      { title: '۴۰ تا ۵۰ سال', score: 1 },
      { title: 'بالای ۵۰ سال', score: 2 },
    ],
  },
  2: {
    step: 2,
    title: 'آیا شما و همسرتان خویشاوند هستید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله، فامیل درجه یک یا دو', score: 4 },
      { title: 'بله، فامیل دورتر', score: 2 },
    ],
  },
  3: {
    step: 3,
    title: 'آیا در خانواده شما یا همسرتان سابقه بیماری ژنتیکی وجود دارد؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله، بیماری مندلی', score: 5 },
      { title: 'بله، سایر بیماری‌ها', score: 3 },
    ],
  },
  4: {
    step: 4,
    title: 'آیا در خانواده شما یا همسرتان سابقه سقط مکرر وجود دارد؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 3 },
    ],
  },
  5: {
    step: 5,
    title: 'آیا در خانواده شما یا همسرتان سابقه بیماری‌های کروموزومی وجود دارد؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 9 },
    ],
  },
  6: {
    step: 6,
    title: 'آیا شما یا همسرتان سابقه بیماری مزمن دارید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 2 },
    ],
  },
  7: {
    step: 7,
    title: 'آیا شما یا همسرتان آزمایش ژنتیکی انجام داده‌اید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله، نتیجه نرمال', score: 0 },
      { title: 'بله، ناقل یا مبتلا', score: 5 },
    ],
  },
  8: {
    step: 8,
    title: 'آیا شما یا همسرتان سابقه مشکلات باروری دارید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 2 },
    ],
  },
  9: {
    step: 9,
    title: 'آیا شما یا همسرتان سیگار، الکل یا مواد مخدر مصرف می‌کنید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 2 },
    ],
  },
  10: {
    step: 10,
    title: 'آیا شما یا همسرتان در معرض مواد شیمیایی یا اشعه هستید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 2 },
    ],
  },
  11: {
    step: 11,
    title: 'آیا مکمل اسید فولیک مصرف می‌کنید؟',
    items: [
      { title: 'بله', score: 0 },
      { title: 'خیر', score: 1 },
    ],
  },
  12: {
    step: 12,
    title: 'آیا در خانواده شما یا همسرتان سابقه تولد نوزاد با ناهنجاری مادرزادی وجود دارد؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 4 },
    ],
  },
  13: {
    step: 13,
    title: 'آیا مورد خاصی وجود دارد که نگران آن هستید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله (لطفاً توضیح دهید)', score: 2 },
    ],
  },
};

export const GENETIC_TEST_ONLINE_RESULTS_LIST: GeneticTestOnlineResultListTypes = {
  result1: {
    id: 1,
    color: 'Error_Error',
    header: {
      title: 'ریسک بالا',
      description: 'مشاوره با متخصص ژنتیک و انجام آزمایشات پیشرفته',
    },
    section1: {
      intro: '  بر اساس اطﻼعاتی که تو پرسشنامه وارد کردی، ریسک ابتلای فرزندت به بیماری‌های ژنتیکی‌ نسبتا بالاست.',
      title: 'ریسک بالا یعنی چی؟',
      text: 'درسته که ریسک بالاست و احتمال بروز مشکلات ژنتیکی در فرزندت کمی بیشتر از حد نرماله؛ اما ما یک سری اقدامات بهت میگیم که رعایت کردنشون می‌تونه این احتمال رو کمتر کنه.',
    },
    section2: [
      {
        title: 'مشاوره ژنتیک فوری',
        icon: '/assets/images/geneticMarketing/mediumRisk/1.webp',
        text: 'قدم اول ویزیت توسط مشاور  ژنتیکه. می‌تونی از بخش کلینیک ایمپو با مشاور ژنتیک مشورت کنی و توصیه‌ها و آزمایش‌های مورد نیازت رو دریافت کنی. ',
        btnName: 'نصب ایمپو و دریافت مشاوره ژنتیک',
        btnUrl: '/download',
      },
      {
        title: 'آزمایش‌های اختصاصی',
        icon: '/assets/images/geneticMarketing/highRisk/2.webp',
        text: 'در موارد با ریسک بالا، ممکنه لازم باشه تست‌های تکمیلی انجام بشه. که این آزمایش‌ها توسط مشاور ژنتیک، برات تجویز می‌شه. آزمایشگاه آنلاین هومکا، انواع آزمایش‌های تشخیصی رو در منزل و محل کار (در مناطق تحت پوشش)، تحت پوشش بیمه پایه و تکمیلی، برات انجام میده. ',
        btnName: 'انجام آزمایش در منزل با هومکا',
        // homkaLink
        btnUrl: '',
      },
      {
        title: 'تجربه یک بارداری و اقدام به بارداری امن ',
        icon: '/assets/images/geneticMarketing/lowRisk/1.webp',
        text: 'ایمپو کنارته تا با یادآوری اقدام‌ها و آزمایش‌های قبل از بارداری، مراقبت‌های هفته‌به ‌هفته بارداری و همچنین بیان  آزمایش‌ها و چکاپ‌های هفتگی و ارایه توصیه‌های شخصی‌سازی شده؛ یک بارداری امن و سالم داشته باشی.',
        btnName: 'نصب ایمپو و تجربه اقدام و بارداری امن  ',
        btnUrl: '/download',
      },
      {
        title: 'آگاهی خانواده',
        icon: '/assets/images/geneticMarketing/highRisk/3.webp',
        text: 'اگر عامل ارثی در میان باشه، مشاور ممکنه پیشنهاد کنه سایر اعضای خانواده‌ات هم بررسی بشن. این کار بهت دید بهتری از وضعیت ژنتیکی خانوادگی می‌ده..',
        btnName: '',
        btnUrl: '',
      },
    ],

    footer: {
      title: 'خیالم راحت باشه؟',
      text: 'نگران نباش. ما اینجاییم تا با افزایش آگاهی، ترس‌ات رو کمتر کنیم. ریسک بالا فقط یعنی باید با دقت بیشتری ادامه بدی. اگه سوالی داشتی یا خواستی اقدام کنی، ایمپو کنارته تا بهترین تصمیم رو بگیری..',
    },
  },
  result2: {
    id: 2,
    color: 'Warning_Warning',
    header: {
      title: 'ریسک متوسط',
      description: 'مشاوره با متخصص ژنتیک و انجام آزمایشات پیشرفته',
    },
    section1: {
      intro:
        ' بر اساس اطﻼعاتی که تو پرسشنامه وارد کردی، ریسک بروز مشکلات‌ ژنتیکی‌ در فرزندت متوسطه. یعنی نه خیلی پایینه و نه خیلی بالا..',
      title: 'ریسک متوسط یعنی چی؟',
      text: 'ریسک متوسط به معنی ایجاد یک مشکل حتمی در فرزندت یا اختلال در بارداری نیست! تو می‌تونی با انجام اقداماتی این احتمال رو کمتر کنی، ما اینها رو بهت میگیم.',
    },
    section2: [
      {
        title: 'مشاوره ژنتیک فوری',
        icon: '/assets/images/geneticMarketing/mediumRisk/1.webp',
        text: 'قدم اول ویزیت توسط مشاور  ژنتیکه. می‌تونی از بخش کلینیک ایمپو با مشاور ژنتیک مشورت کنی و توصیه‌ها و آزمایش‌های مورد نیازت رو دریافت کنی.',
        btnName: 'نصب ایمپو و دریافت مشاوره ژنتیک',
        btnUrl: '/download',
      },
      {
        title: 'آزمایش‌های اختصاصی',
        icon: '/assets/images/geneticMarketing/lowRisk/2.webp',
        text: 'پس از مشورت با متخصص ممکنه لازم باشه تست‌های تکمیلی که برات تجویز شده رو  انجام بدی. آزمایشگاه آنلاین هومکا، انواع آزمایش‌های تشخیصی رو در منزل و محل کار (در مناطق تحت پوشش)، تحت پوشش بیمه پایه و تکمیلی، برات انجام میده. ',
        btnName: 'انجام آزمایش در منزل با هومکا',
        // homkaLink
        btnUrl: '',
      },
      {
        title: 'دارو',
        icon: '/assets/images/geneticMarketing/mediumRisk/3.webp',
        text: ' خودسرانه هیچ دارویی رو شروع نکن، از مصرف داروهای گیاهی حتی اگر از داروخانه تهیه کردی پرهیز کن. اگر لازم بشه پزشک متخصص داروهای لازم (حتی تقویتی و ویتامین‌ها) رو برات تجویز می‌کنه.',
        btnName: '',
        btnUrl: '',
      },
      {
        title: 'سبک زندگی',
        icon: '/assets/images/geneticMarketing/mediumRisk/4.webp',
        text: 'در کنار ویزیت توسط متخصص و انجام آزمایش‌های لازم، سبک زندگی هم روی سلامت ژنتیک جنین موثره. پس در کنار همه این موارد بهتره سیگار، قلیان و الکل رو کنار بذاری، تغذیه سالم داشته باشی و ورزش کنی.',
        btnName: '',
        btnUrl: '',
      },
      {
        title: 'تجربه یک بارداری و اقدام به بارداری امن ',
        icon: '/assets/images/geneticMarketing/mediumRisk/3.webp',
        text: 'ایمپو کنارته تا با یادآوری اقدام‌ها و آزمایش‌های قبل از بارداری، مراقبت‌های هفته‌به ‌هفته بارداری و همچنین بیان  آزمایش‌ها و چکاپ‌های هفتگی و ارایه توصیه‌های شخصی‌سازی شده؛ یک بارداری امن و سالم داشته باشی..',
        btnName: 'نصب ایمپو و تجربه اقدام و بارداری امن',
        btnUrl: '/download',
      },
    ],

    footer: {
      title: ' خیالم راحت باشه؟',
      text: 'نگران نباش. ما اینجاییم تا با افزایش آگاهی، ترس‌ات رو کمتر کنیم. ریسک متوسط فقط یعنی باید با دقت بیشتری ادامه بدی. اگه سوالی داشتی یا خواستی اقدام کنی، ایمپو کنارته تا بهترین تصمیم رو بگیری..',
    },
  },
  result3: {
    id: 3,
    color: 'Success_Success',
    header: {
      title: 'ریسک پایین',
      description: 'مشاوره با متخصص ژنتیک و انجام آزمایشات پیشرفته',
    },
    section1: {
      intro:
        'بر اساس اطلاعات پرسشنامه‌ات، خیالت راحت باشه، چون ریسک ژنتیکی‌ات فعلاً پایینه و این یعنی احتمال بروز مشکل ژنتیکی جدی در بارداریت خیلی کمه. در ادامه این موضوع رو بیشتر برات توضیح میدیم.',
      title: 'ریسک پایین یعنی چی؟',
      text: 'ریسک پایین یعنی تو زندگیت فاکتورهای پر خطر مثل بیماری ارثی یا عادت‌های مضر کمه یا اصلا وجود نداره؛ بهت تبریک میگم..',
    },
    section2: [
      {
        title: 'حواسمون بهت هست',
        icon: '/assets/images/geneticMarketing/lowRisk/1.webp',
        text: 'در طول دوره بارداری و اقدام به بارداری  باید حسابی حواست به خودت باشه.  کلی نکات مراقبتی هست که باید توی این مسیر رعایت کنی. ایمپو این نکات رو بهت یاد میده توی این مسیر اجازه نمیده  آب تو دلت تکون نخوره.',
        btnName: 'نصب ایمپو',
        btnUrl: '/download',
      },
      {
        title: 'آزمایش خاصی هست که انجام بدم؟',
        icon: '/assets/images/geneticMarketing/lowRisk/2.webp',
        text: 'دوره بارداری  و اقدام مراقبت‌ها و آزمایش‌های زیادی نیاز داره. پس بهتره علاوه‌بر چکاپ در دوره بارداری،‌قبل از اقدام به بارداری هم یک چکاپ کامل بکنی تا خیالت بابت همه‌چیز راحت باشه. آزمایشگاه آنلاین هومکا، انواع آزمایش‌های تشخیصی رو در منزل و محل کار (در مناطق تحت پوشش)، تحت پوشش بیمه پایه و تکمیلی، برات انجام میده.. ',
        btnName: 'انجام آزمایش در منزل با هومکا',
        // homkaLink
        btnUrl: '',
      },
    ],
    footer: {
      title: 'خیالم کامل راحت باشه؟',
      text: 'تقریباً! اما ژنتیک کمی پیچیده‌ست و همیشه یه احتمال خیلی کوچیک برای اتفاق‌های غیرمنتظره وجود داره؛ پس بهتره با شروع بارداری زیر نظر مشاور ژنتیک و متخصص زنان باشی تا این مساله رو پیشگیری و مدیریت کنی. ولی در حالت کلی و با اطلاعات فعلی‌ات جای نگرانی وجود نداره..',
    },
  },
};
