import { GeneticTestOnlineQuestionListTypes, GeneticTestOnlineResultListTypes } from './types';

export const GENETIC_TEST_ONLINE_STEP_QUERY_NAME = 'step';
export const GENETIC_TEST_ONLINE_STEP_SESSION_SCORE_NAME = 'testOnlineScore';
export const GENETIC_TEST_ONLINE_STEP_SESSION_DESCRIPTION_NAME = 'testOnlineDescription';

export const GENETIC_TEST_ONLINE_QUESTION_LIST: GeneticTestOnlineQuestionListTypes = {
  0: {
    step: 0,
    title: 'سن شما (مادر آینده) چند سال است؟',
    items: [
      { title: 'کمتر از ۳۰ سال', score: 0 },
      { title: '۳۰ تا ۳۵ سال', score: 1 },
      { title: 'بالای ۳۵ سال', score: 3 },
    ],
  },
  1: {
    step: 1,
    title: 'سن همسر/پدر آینده چند سال است؟',
    items: [
      { title: 'کمتر از ۴۰ سال', score: 0 },
      { title: '۴۰ تا ۵۰ سال', score: 1 },
      { title: 'بالای ۵۰ سال', score: 2 },
    ],
  },
  2: {
    step: 2,
    title: 'آیا شما و همسرتان خویشاوند هستید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله، فامیل درجه یک یا دو', score: 4 },
      { title: 'بله، فامیل دورتر', score: 2 },
    ],
  },
  3: {
    step: 3,
    title: 'آیا در خانواده شما یا همسرتان سابقه بیماری ژنتیکی وجود دارد؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله، بیماری مندلی', score: 5 },
      { title: 'بله، سایر بیماری‌ها', score: 3 },
    ],
  },
  4: {
    step: 4,
    title: 'آیا در خانواده شما یا همسرتان سابقه سقط مکرر وجود دارد؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 3 },
    ],
  },
  5: {
    step: 5,
    title: 'آیا در خانواده شما یا همسرتان سابقه بیماری‌های کروموزومی وجود دارد؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 9 },
    ],
  },
  6: {
    step: 6,
    title: 'آیا شما یا همسرتان سابقه بیماری مزمن دارید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 2 },
    ],
  },
  7: {
    step: 7,
    title: 'آیا شما یا همسرتان آزمایش ژنتیکی انجام داده‌اید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله، نتیجه نرمال', score: 0 },
      { title: 'بله، ناقل یا مبتلا', score: 5 },
    ],
  },
  8: {
    step: 8,
    title: 'آیا شما یا همسرتان سابقه مشکلات باروری دارید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 2 },
    ],
  },
  9: {
    step: 9,
    title: 'آیا شما یا همسرتان سیگار، الکل یا مواد مخدر مصرف می‌کنید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 2 },
    ],
  },
  10: {
    step: 10,
    title: 'آیا شما یا همسرتان در معرض مواد شیمیایی یا اشعه هستید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 2 },
    ],
  },
  11: {
    step: 11,
    title: 'آیا مکمل اسید فولیک مصرف می‌کنید؟',
    items: [
      { title: 'بله', score: 0 },
      { title: 'خیر', score: 1 },
    ],
  },
  12: {
    step: 12,
    title: 'آیا در خانواده شما یا همسرتان سابقه تولد نوزاد با ناهنجاری مادرزادی وجود دارد؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله', score: 4 },
    ],
  },
  13: {
    step: 13,
    title: 'آیا مورد خاصی وجود دارد که نگران آن هستید؟',
    items: [
      { title: 'خیر', score: 0 },
      { title: 'بله (لطفاً توضیح دهید)', score: 2 },
    ],
  },
};

export const GENETIC_TEST_ONLINE_RESULTS_LIST: GeneticTestOnlineResultListTypes = {
  result1: {
    id: 1,
    color: 'Error_Error',
    header: {
      title: 'ریسک بالا',
      description: 'مشاوره با متخصص ژنتیک و انجام آزمایشات پیشرفته',
    },
    section1: {
      intro:
        'بر اساس اطﻼعاتی که تو پرسشنامه وارد کردی، ریسک ابتلای فرزندت به بیماری‌های ژنتیکی‌ نسبتا بالاست. حتما ادامه محتوا رو بخون چون راهکارهای مفیدی بهت پیشنهاد دادیم. ما اینجاییم که نگرانیت رو کم کنیم.',
      title: 'ریسک بالا یعنی چی؟',
      text: 'درسته که ریسک بالاست و احتمال بروز مشکلات ژنتیکی در فرزندت کمی بیشتر از حد نرماله؛ اما ما یک سری اقدامات بهت میگیم که رعایت کردنشون می‌تونه این احتمال رو کمتر کنه.',
    },
    section2: [
      {
        title: 'مشاوره ژنتیک فوری',
        icon: '/assets/images/geneticMarketing/mediumRisk/1.webp',
        text: 'قدم اول ویزیت توسط مشاور  ژنتیکه. تو این زمینه می‌تونی از ایمپو کمک بگیری. اپلیکیشنی که در حوزه سلامت بانوان فعالیت می‌کنه و یه کلینیک آنلاین داره که پزشکان متخصص از جمله زنان، زایمان و ژنتیک اونجا فعالیت دارن و در صورت نیاز آزمایش‌های لازم رو برات تجویز می‌کنن.',
        btnName: 'نصب ایمپو و دریافت مشاوره ژنتیک',
        btnUrl: 'https://impo.app/download',
      },
      {
        title: 'آزمایش‌های اختصاصی',
        icon: '/assets/images/geneticMarketing/highRisk/2.webp',
        text: 'در موارد با ریسک بالا، ممکنه لازم باشه تست‌های تکمیلی انجام بشه، مثل بررسی ناقل بودن بیماری‌ها، کاریوتایپ، یا حتی غربالگری پیش از لانه‌گزینی این آزمایش‌ها توسط مشاور ژنتیک، برات تجویز می‌شه آزمایشگاه آنلاین هومکا، انواع آزمایش‌های تشخیصی رو در منزل و محل کار (در مناطق تحت پوشش)، تحت پوشش بیمه پایه و تکمیلی، برات انجام میده. .',
        btnName: 'انجام آزمایش در منزل با هومکا',
        btnUrl: '',
      },
      {
        title: 'تجربه یک بارداری امن و بدون استرس',
        icon: '/assets/images/geneticMarketing/lowRisk/1.webp',
        text: 'بعد از مشورت با مشاور ژنتیک لازمه یک برنامه مشخص برای بارداری داشته باشی. اینجا ایمپو کنارته تا با یادآوری اقدام‌ها و آزمایش‌های قبل از بارداری، مراقبت‌های هفته‌به ‌هفته بارداری و همچنین بیان  آزمایش‌ها و چکاپ‌های هفتگی و ارایه توصیه‌های شخصی‌سازی شده؛ یک بارداری امن و سالم داشته باشی.',
        btnName: 'نصب ایمپو و تجربه اقدام و بارداری امن ',
        btnUrl: 'https://impo.app/download',
      },
      {
        title: 'آگاهی خانواده',
        icon: '/assets/images/geneticMarketing/highRisk/3.webp',
        text: 'اگر عامل ارثی در میان باشه، مشاور ممکنه پیشنهاد کنه سایر اعضای خانواده‌ات هم بررسی بشن. این کار بهت دید بهتری از وضعیت ژنتیکی خانوادگی می‌ده.',
        btnName: '',
        btnUrl: '',
      },
    ],

    footer: {
      title: 'خیالم راحت باشه؟',
      text: 'نگران نباش. ما اینجاییم تا با افزایش آگاهی، ترس‌ات رو کمتر کنیم. ریسک بالا فقط یعنی باید با دقت بیشتری ادامه بدی. اگه سوالی داشتی یا خواستی اقدام کنی، ایمپو کنارته تا بهترین تصمیم رو بگیری.',
    },
  },
  result2: {
    id: 2,
    color: 'Warning_Warning',
    header: {
      title: 'ریسک متوسط',
      description: 'مشاوره با متخصص ژنتیک و انجام آزمایشات پیشرفته',
    },
    section1: {
      intro:
        ' بر اساس اطﻼعاتی که تو پرسشنامه وارد کردی، ریسک بروز مشکلات‌ ژنتیکی‌ در فرزندت متوسطه. یعنی نه خیلی پایینه و نه خیلی بالا. پس جای نگرانی نیست، ولی بهتره بیشتر مراقب باشی در ادامه راهکارهای لازم رو بیان کردیم.',
      title: 'ریسک متوسط یعنی چی؟',
      text: 'ریسک متوسط به معنی ایجاد یک مشکل حتمی در فرزندت یا اختلال در بارداری نیست! تو می‌تونی با انجام اقداماتی این احتمال رو کمتر کنی، ما اینها رو بهت میگیم. ',
    },
    section2: [
      {
        title: 'مشاوره ژنتیک فوری',
        icon: '/assets/images/geneticMarketing/mediumRisk/1.webp',
        text: 'باقدم اول ویزیت توسط مشاور ژنتیکه. از بخش کلینیک در اپلیکیشن ایمپو می‌تونی با مشاور ژنتیک ویزیت بشی و خیالت رو راحت کنی. ',
        btnName: 'نصب ایمپو و دریافت مشاوره ژنتیک',
        btnUrl: 'https://impo.app/download',
      },
      {
        title: 'آزمایش‌های اختصاصی',
        icon: '/assets/images/geneticMarketing/lowRisk/2.webp',
        text: 'بعد از اینکه توسط پزشک متخصص ویزیت شدی برای اطمینان خاطر لازمه یک سری آزمایش انجام بدی که توسط مشاور ژنتیک، برات تجویز می‌شه. آزمایشگاه آنلاین هومکا، انواع آزمایش‌های تشخیصی رو در منزل و محل کار (در مناطق تحت پوشش)، تحت پوشش بیمه پایه و تکمیلی، برات انجام میده. ',
        btnName: 'انجام آزمایش در منزل با هومکا',
        btnUrl: '',
      },
      {
        title: 'دارو',
        icon: '/assets/images/geneticMarketing/mediumRisk/3.webp',
        text: ' خودسرانه هیچ دارویی رو شروع نکن، از مصرف داروهای گیاهی حتی اگر از داروخانه تهیه کردی پرهیز کن. اگر لازم بشه پزشک متخصص داروهای لازم (حتی تقویتی و ویتامین‌ها) رو برات تجویز می‌کنه.',
        btnName: '',
        btnUrl: '',
      },
      {
        title: 'سبک زندگی',
        icon: '/assets/images/geneticMarketing/mediumRisk/4.webp',
        text: 'در کنار ویزیت توسط متخصص و انجام آزمایش‌های لازم، سبک زندگی هم روی سلامت ژنتیک جنین موثره. پس در کنار همه این موارد بهتره سیگار، قلیان و الکل رو کنار بذاری، تغذیه سالم داشته باشی و ورزش کنی.',
        btnName: '',
        btnUrl: '',
      },
      {
        title: 'تجربه یک بارداری و اقدام امن و بدون استرس',
        icon: '/assets/images/geneticMarketing/mediumRisk/3.webp',
        text: 'بعد از مشورت با مشاور ژنتیک لازمه یک برنامه مشخص برای بارداری داشته باشی. اینجا ایمپو کنارته تا با یادآوری اقدام‌ها و آزمایش‌های قبل از بارداری، مراقبت‌های هفته‌به ‌هفته بارداری و همچنین بیان  آزمایش‌ها و چکاپ‌های هفتگی و ارایه توصیه‌های شخصی‌سازی شده؛ یک بارداری امن و سالم داشته باشی.',
        btnName: 'نصب ایمپو و تجربه اقدام و بارداری امن ',
        btnUrl: 'https://impo.app/download',
      },
    ],

    footer: {
      title: ' خیالم راحت باشه؟',
      text: 'نگران نباش. ما اینجاییم تا با افزایش آگاهی، ترس‌ات رو کمتر کنیم. ریسک متوسط فقط یعنی باید با دقت بیشتری ادامه بدی. اگه سوالی داشتی یا خواستی اقدام کنی، ایمپو کنارته تا بهترین تصمیم رو بگیری.',
    },
  },
  result3: {
    id: 3,
    color: 'Success_Success',
    header: {
      title: 'ریسک پایین',
      description: 'مشاوره با متخصص ژنتیک و انجام آزمایشات پیشرفته',
    },
    section1: {
      intro:
        'بر اساس اطلاعات پرسشنامه‌ات، خیالت راحت باشه، چون ریسک ژنتیکی‌ات فعلاً پایینه و این یعنی احتمال بروز مشکل ژنتیکی جدی در بارداریت خیلی کمه. در ادامه این موضوع رو بیشتر برات توضیح میدیم.',
      title: 'ریسک پایین یعنی چی؟',
      text: 'ریسک پایین یعنی تو زندگیت فاکتورهای پر خطر مثل بیماری ارثی یا عادت‌های مضر کمه یا اصلا وجود نداره، این نکته‌ی مثبت و خوبیه؛ بهت تبریک میگم.',
    },
    section2: [
      {
        title: 'تجربه یک بارداری و اقدام امن و بدون استرس',
        icon: '/assets/images/geneticMarketing/lowRisk/1.webp',
        text: 'بعد از مشورت با مشاور ژنتیک لازمه یک برنامه مشخص برای بارداری داشته باشی. اینجا ایمپو کنارته تا با یادآوری اقدام‌ها و آزمایش‌های قبل از بارداری، مراقبت‌های هفته‌به ‌هفته بارداری و همچنین بیان  آزمایش‌ها و چکاپ‌های هفتگی و ارایه توصیه‌های شخصی‌سازی شده؛ یک بارداری امن و سالم داشته باشی.',
        btnName: 'نصب ایمپو و تجربه اقدام و بارداری امن',
        btnUrl: 'https://impo.app/download',
      },
      {
        title: 'آزمایش‌های اختصاصی',
        icon: '/assets/images/geneticMarketing/lowRisk/2.webp',
        text: 'قبل از اقدام به بارداری بهتره یک چکاپ کامل بکنی تا خیالت بابت همه‌چیز راحت باشه. آزمایشگاه آنلاین هومکا، انواع آزمایش‌های تشخیصی رو در منزل و محل کار (در مناطق تحت پوشش)، تحت پوشش بیمه پایه و تکمیلی، برات انجام میده. ',
        btnName: 'انجام آزمایش در منزل با هومکا',
        btnUrl: '',
      },
    ],
    footer: {
      title: 'خیالم کامل راحت باشه؟',
      text: 'تقریباً! ژنتیک یه کم پیچیده ‌ست و همیشه یه احتمال خیلی کوچیک برای چیزای غیرمنتظره وجود داره که با شروع بارداری و تحت نظر متخصصین ژنتیک و متخصصین زنان بودن همگی قابل مدیریت و حتی پیشگیری هستند. با این حال اﻻن با این اطﻼعات جایی برای نگرانی خاصی وجود نداره.',
    },
  },
};
