export const DrContentList = [
    {
        title: 'تخصص کاری:',
        texts: ['بیماری های زنان', 'مراقبت های بارداری و‌ پیش از بارداری', 'نازایی - تخصص بالینی جراحی زنان و زایمان']
    },
    {
        title: '',
        texts: '1922 ویزیت در کلینیک ایمپو'
    },
    {
        title: 'تخصص کاری:',
        texts: ['بیماری های زنان', 'مراقبت های بارداری و‌ پیش از بارداری', 'نازایی - تخصص بالینی جراحی زنان و زایمان']
    },
    {
        title: 'تخصص کاری:',
        texts: ['بیماری های زنان', 'مراقبت های بارداری و‌ پیش از بارداری', 'نازایی - تخصص بالینی جراحی زنان و زایمان']
    },
    {
        title: 'تخصص کاری:',
        texts: ['بیماری های زنان', 'مراقبت های بارداری و‌ پیش از بارداری', 'نازایی - تخصص بالینی جراحی زنان و زایمان']
    },
]

