import { FaqTypes } from './types';

export const FAQS: FaqTypes = [
  {
    id: '1',
    question: 'برای محاسبه زمان تخمک گذاری بعد از پریود انلاین چه اطلاعاتی لازم است؟',
    answer: 'تاریخ شروع آخرین پریود و میانگین طول چرخه قاعدگی را باید وارد کنید.',
  },
  {
    id: '2',
    question: 'آیا محاسبه آنلاین زمان تخمک‌گذاری ۱۰۰ درصد درست است؟',
    answer:
      'محاسبه آنلاین زمان تخمک‌گذاری تخمینی است و دقت صددرصدی ندارد. برای نتیجه دقیق‌تر، بهتر است سایر علائم جسمانی را نیز در نظر بگیرید.',
  },
  {
    id: '3',
    question: 'آیا ماشین حساب تخمک گذاری برای پریودهای نامنظم هم کار می‌کند؟',
    answer: 'بله، اما در چرخه‌های نامنظم دقت کمتری دارد و بهتر است تست‌های هورمونی یا علائم بدن را نیز بررسی کنید.',
  },
];
