import { FaqTypes } from './types';

export const FAQS: FaqTypes[] = [
  {
    id: '1',
    question: 'آزمایش ژنتیک قبل از بارداری چیست؟',
    answer:
      'آزمایش ژنتیک قبل از بارداری به ارزیابی DNA والدین برای شناسایی خطر انتقال اختلالات ژنتیکی به فرزندان اشاره دارد. این آزمایش به زوج‌ها کمک می‌کند تا از وضعیت ناقل بودن خود آگاه شوند و تصمیمات آگاهانه‌تری در مورد بارداری بگیرند.',
  },
  {
    id: '2',
    question: 'چه نوع اختلالات ژنتیکی را می‌توان با آزمایش‌ ژنتیک قبل بارداری شناسایی کرد؟',
    answer:
      'این آزمایش می‌تواند اختلالاتی مانند سیستیک فیبروزیس، کم‌خونی داسی‌شکل، تالاسمی و برخی دیگر از بیماری‌های ارثی را شناسایی کند.',
  },
  {
    id: '3',
    question: 'آیا همه زوج‌ها نیاز به انجام این آزمایش دارند؟',
    answer:
      'در حالی که انجام این آزمایش برای همه زوج‌ها الزامی نیست، اما برای کسانی که سابقه خانوادگی بیماری‌های ژنتیکی دارند یا از نژادهای خاصی هستند که بیشتر در معرض خطر هستند، توصیه می‌شود.',
  },
  {
    id: '4',
    question: 'هزینه این آزمایش چقدر است؟',
    answer:
      'هزینه آزمایش ژنتیک قبل از بارداری بسته به نوع آزمایش و محل انجام آن متفاوت است. معمولاً هزینه‌ها بین چند صد تا چند میلیون تومان متغیر است.',
  },
  {
    id: '5',
    question: 'آیا نتایج آزمایش‌ های ژنتیک قبل از بارداری، قطعی هستند؟',
    answer:
      'نتایج این آزمایش‌ها معمولاً به احتمال ناقل بودن یا عدم ناقل بودن اشاره دارند و نمی‌توانند به طور قطعی پیش‌بینی کنند که آیا فرزند مبتلا به یک بیماری خواهد بود یا خیر.',
  },
];
